/// اول شيئ اسوي قلوبل ستيت و اعطيها قيم ابتدائية
const initState = {
  userTask: [], // قيمه ابتدائية نوعها ااراي فاضية 
  adminTask: [],
};
/////////////////////////////////////////////////////////////////////////
 // آيش تسمى هذه الفنكشن .. نسيت ؟ 
 // تاخذ ٢ ارقيومنت .. الاولى تاخذ القيم المبدائية للستيت ،،، الثاني تاخذ الاكشن 

const tasks = (state = initState, action) => {
  const { type, payload } = action; ///

  switch (type) {
    case "USER_TASKS": // في حالة ان اليوزر كان يوزر عادي
      const { userTask } = payload; // الداتا اللي داخل البيلود فقط اليوزر تاسك
      return { userTask }; // او اقول له رجع لي بيلود ،، ما تفرق

    case "ADMIN_TASKS": // في حالة كان اليوزر آدمن
      const { adminTask } = payload; // الداتا اللي داخل البيلود فقط الادمن تاسك
      return { adminTask }; // او اقول له رجع لي بيلود ،، ما تفرق

      ///// قلنا انه اذا ماطبق احد هذه الكيسات ،، لازم يرجع شي اللي هو الستيت بالقيم البدائية 
    default:
      return state;
  }
};
export default tasks; 

/////////////////////////////////////////////////////////////////////////

/// في حالة ان اليوزر كان عادي 
export const userTasks = (data) => {
  return {
    type: "USER_TASKS", // :في حالة
    payload: data, // البيلود يحتوي على الداتا،، الداتا اللي هي يوزر تاسك
  };
};

/////////////////////////////////////////////////////////////////////////

/// في حالة ان اليوزر كان آدمن 

export const adminTasks = (data) => {
  return {
    type: "ADMIN_TASKS", //:في حالة
    payload: data, // البيلود يحتوي على الداتا،، الداتا اللي هي آدمن تاسك
  };
};